// pages/search/search.js
Page({
  data: {
    list: []
  },
  bindKeywords(){
    this.setData({
      list: [{
        text: '北京-海淀-永泰小区（求购）',
        info: '一条金鱼'
      },
      {
        text: '北京-朝阳-宝盛里（出售）',
        info: '老自行车一个'
      },
      {
        text: '北京-丰台-怡清园（求购）',
        info: '烧烤架子一套'
      },
      {
        text: '北京-海淀-强佑新城（求购）',
        info: '小白猫一只，可爱温顺'
      },
      {
        text: '北京-东城-天香苑（出售）',
        info: '80年代鸟笼子一个，八成新'
      },
      {
        text: '北京-朝阳-御龙湾（求购）',
        info: '二手空调'
      },
      {
        text: '北京-西城-田景华府（出售）',
        info: '八成新冰箱一台，完好无损'
      },
      {
        text: '北京-丰台-现代城（出售）',
        info: '小仓鼠一对，年龄1岁半'
      },
      {
        text: '北京-朝阳-关奥新城（求购）',
        info: '家用洗衣机一台'
      }]
    });
  }
})